fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.Сотрудник");
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ОтпускаСотрудников.ДатаОкончания");
	
	ВыбранныйГод = НачалоГода(Год);
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаНачала) Тогда
			Сообщение = "Год ""Даты начала"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаНачала");
			Отказ = Истина;
		КонецЕсли;
		
		Если ВыбранныйГод <> НачалоГода(Строка.ДатаОкончания) Тогда
			Сообщение = "Год ""Даты окончания"" должен быть таким же как указано в реквизите документа ""Год""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
		
		Если ((НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / 86400 + 1) < 1 Тогда
			Сообщение = "Значение поля ""Дата окончания"" должно быть меньше либо равно значению поля ""Дата начала""";
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1) + "].ДатаОкончания");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = Год;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
